Documents/ПроизводствоЗаСмену.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПроизводствоЗаСмену</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачальникСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеализованнаяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатраченныеМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаРабочейСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>УстановкаРабочейСмены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтработанныеСмены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СотрудникиСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроизводствоЗаСмену/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСменуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаРабочейСменыСотрудникиСмены.Ссылка КАК Ссылка,
	|	УстановкаРабочейСменыСотрудникиСмены.НомерСтроки КАК НомерСтроки,
	|	УстановкаРабочейСменыСотрудникиСмены.ФИО КАК ФИО,
	|	УстановкаРабочейСменыСотрудникиСмены.Должность КАК Должность
	|ИЗ
	|	Документ.УстановкаРабочейСмены.СотрудникиСмены КАК УстановкаРабочейСменыСотрудникиСмены
	|ГДЕ
	|	УстановкаРабочейСменыСотрудникиСмены.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		НоваяСтрока = Объект.СотрудникиСмены.Добавить();
		НоваяСтрока.ФИО = ВыборкаДетальныеЗаписи.ФИО;
		НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Должность;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСмену(Команда)
	
	ТЧСотрудники = Объект.СотрудникиСмены; 
	// проверка на двойную запись одного и того же сотрудника
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(ТЧСотрудники) = Истина Тогда
		ОповещениеОбОшибках.ИмеютсяКоллизииВТабличнойЧасти();
		Возврат;
	КонецЕсли;
	
	// банальная проверка, чтобы случайно не записать не те данные
	Если Объект.СотрудникиСмены.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЦехПолон1",ЭтаФорма.ЭтотОбъект);
		ТекстВопроса = "В таблице уже имеются записи о сотрудниках, провести запись с удалением прыдыдущих ?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		ЗаполнитьСменуНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦехПолон1 (Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СотрудникиСмены.Очистить();
		ЗаполнитьСменуНаСервере();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьСменуНаСервере();
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры;
